In [15]:
import pandas as pd
from pathlib import Path

In [9]:
sales_data = pd.read_csv("budget_data.csv")

In [10]:
sales_data

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [18]:
# Created path file for CSV file 

sales_path = Path("budget_data.csv") 

# Created variable named "df" and assigned it to a path file.

df = pd.read_csv(sales_path)

df.head()

       Date  Profit/Losses
0  Jan-2010         867884
1  Feb-2010         984655
2  Mar-2010         322013
3  Apr-2010         -69417
4  May-2010         310503

In [19]:
# Identifying dataframe types

df.dtypes

Date             object
Profit/Losses     int64
dtype: object

In [20]:
df.count()

Date             86
Profit/Losses    86
dtype: int64

In [21]:
#The isnull() method returns a dataframe object where all the values are replaced with a Boolean value True for NULL values, and otherwise False.

df.isnull()

     Date  Profit/Losses
0   False          False
1   False          False
2   False          False
3   False          False
4   False          False
..    ...            ...
81  False          False
82  False          False
83  False          False
84  False          False
85  False          False

[86 rows x 2 columns]

In [22]:
# Percentage of nulls

df.isnull().mean() * 100

Date             0.0
Profit/Losses    0.0
dtype: float64

In [23]:
# Created a variable, 'total_months', and assigned a value to calculate total number of months

total_months = df['Date'].count()

total_months

86

In [33]:
# Created a column of shifted values.

df['shifted_column'] = df['Profit/Losses'].shift(1)

df

        Date  Profit/Losses  shifted_column  difference  new_column
0   Jan-2010         867884             NaN         NaN         NaN
1   Feb-2010         984655        867884.0    116771.0    867884.0
2   Mar-2010         322013        984655.0   -662642.0    984655.0
3   Apr-2010         -69417        322013.0   -391430.0    322013.0
4   May-2010         310503        -69417.0    379920.0    -69417.0
..       ...            ...             ...         ...         ...
81  Oct-2016         102685        768450.0   -665765.0    768450.0
82  Nov-2016         795914        102685.0    693229.0    102685.0
83  Dec-2016          60988        795914.0   -734926.0    795914.0
84  Jan-2017         138230         60988.0     77242.0     60988.0
85  Feb-2017         671099        138230.0    532869.0    138230.0

[86 rows x 5 columns]

In [31]:
# Created a column with the difference between current value 'Profit/Losses' and last line value 'Shifted_column'

df['difference'] = df['Profit/Losses'] - df['shifted_column']

df

        Date  Profit/Losses  shifted_column  difference
0   Jan-2010         867884             NaN         NaN
1   Feb-2010         984655        867884.0    116771.0
2   Mar-2010         322013        984655.0   -662642.0
3   Apr-2010         -69417        322013.0   -391430.0
4   May-2010         310503        -69417.0    379920.0
..       ...            ...             ...         ...
81  Oct-2016         102685        768450.0   -665765.0
82  Nov-2016         795914        102685.0    693229.0
83  Dec-2016          60988        795914.0   -734926.0
84  Jan-2017         138230         60988.0     77242.0
85  Feb-2017         671099        138230.0    532869.0

[86 rows x 4 columns]

In [26]:
# Created a variable, 'average_difference' and assigned value to calculate average difference

average_difference = df['difference'].mean()

average_difference

-2315.1176470588234

In [39]:
total = df['Profit/Losses'].sum()
total

38382578

In [27]:
# Created a variable; 'greatest_increase' and assigned a value to formulate greatest increase

greatest_increase = df['difference'].max()

greatest_increase

1926159.0

In [28]:
# Taking the value of 'greatest_increase' and locating it inside df to determine date

df.loc[df['difference']==greatest_increase]

        Date  Profit/Losses  shifted_column  difference
25  Feb-2012        1170593       -755566.0   1926159.0

In [43]:
feb = df.loc[25, 'Date']
feb

'Feb-2012'

In [29]:
# Created a variable; 'greatest_decrease' and assigned value to formulate greatest decrease
greatest_decrease = df['difference'].min()

greatest_decrease

-2196167.0

In [36]:
df.loc[df['difference']==greatest_decrease]

        Date  Profit/Losses  shifted_column  difference  new_column
44  Sep-2013       -1196225        999942.0  -2196167.0    999942.0

In [44]:
Sept = df.loc[44, 'Date']
Sept

'Sep-2013'

In [37]:
#print(f'total months: {total_months}')

total months: 86

In [40]:
#print(f'total: {total}')

total: 38382578

In [42]:
#print(f'average change: {average_difference}')

average change: -2315.1176470588234

In [49]:
#print(f'Greatest Increase in Profits: {feb} ({greatest_increase})')

Greatest Increase in Profits: Feb-2012 (1926159.0)

In [50]:
#print(f'Greatest Decrease in Profits: {Sept} ({greatest_decrease})')

Greatest Decrease in Profits: Sep-2013 (-2196167.0)

In [52]:
print(f'Total months: {total_months}')
print(f'Total: {total}')
print(f'Average change: {average_difference}')
print(f'Greatest Increase in Profits: {feb} ({greatest_increase})')
print(f'Greatest Decrease in Profits: {Sept} ({greatest_decrease})')

Total months: 86
Total: 38382578
Average change: -2315.1176470588234
Greatest Increase in Profits: Feb-2012 (1926159.0)
Greatest Decrease in Profits: Sep-2013 (-2196167.0)